Revit 2025 API
HorizontalCurveType Enumeration
 Represents the curve types for the horizontal curves which define Alignment geometry.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum HorizontalCurveType
Public Enumeration HorizontalCurveType
public enum class HorizontalCurveType
type HorizontalCurveType
Members
Member name | Value | Description
Unknown | 0 |  Unknown curve type, used in cases where the curve type cannot be determined.
Line | 1 |  Line curve type.
Arc | 2 |  Arc curve type.
Spiral | 3 |  Spiral curve type.
See Also
Reference
Autodesk.Revit.DB.Infrastructure Namespace